"use client";
import React from "react";
import TabItems from './components/TabItems';
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return <>
  <section className="flex gap-4 justify-center">
    <TabItems title={'همه'}/>
    <TabItems title={'مشاوره آنلاین'} />
    <TabItems title={'تیم پزشکی'} />
    <TabItems title={'امتیاز دهی'} />
    <TabItems title={'پشتیبانی'} />
  </section>
  </>;
}
