"use client";
import React from "react";
import Item from "./Item";
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="h-9 w-full flex gap-4 mb-8">
        <Item title="پوست و مو" />
        <Item title="قلب و عروق" />
        <Item title="گوارش" />
        <Item title="گوش و حلق و بینی" />
        <Item title="عفونی" />
        <Item title="داخلی" />
        <Item title="کودکان" />
        <Item title="پاتولوژی(آسیب شناسی)" />
        <Item title="کودکان" />
        <Item title="مغز و اعصاب" />
        {/* <Item title="" />
        <Item title="" />
        <Item title="" /> */}
      </section>
    </>
  );
}
