"use client";
import React from "react";
import Image from "next/image";
import CommentItems from "./components/CommentItems"
// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//

export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return <>
  <section className="py-6">
    <header className="flex gap-3 items-center mb-6">
      <Image src={"/images/icons/message-text.svg"} width={32} height={32} alt=""/>
      <span className="text-[20px] font-bold text-[#2C8EE8]">نظرات کاربران </span>
      </header>
      <section className="overflow-y-scroll h-[616px] grid gap-6">
        <CommentItems image={"/images/Group 48096040.png"} name={"مهلا مرزبان"} text={"عالی خیلی راضی بودم اگزما و حساسیت پوستی داشتم هیچ دکتری درمان نتونست کنه با یبار ویزیت خوب شدم."}/>
        <CommentItems image={"/images/Group 48096040.png"} name={"علی عباسی"} text={"عالی خیلی راضی بودم اگزما و حساسیت پوستی داشتم هیچ دکتری درمان نتونست کندکتر معجزه گر من آنژیو کردم سه تا از رگ های قلبم مسدود شده بود که با توجه به گرفتگی شدید هیچ فوق تخصصی حاضر به باز کردن ازطریق استنت نشدن وهمه عمل قلب باز را توصیه کردن ولی با ویزیتی که با نوبت قبلی داشتم دکتر حاضر به آنژیو اینجانب شدند وخیلی مطمئن به من اطمینان وقوت قلب دادن که در نهایت کار آنژیو را شروع کردن ونتیجه هم عالی عالی "}/>
        <CommentItems image={"/images/Group 48096040.png"} name={"یعقوب جعفری"} text={"سلام دوستان. پدر بنده تقریباً یک سال دچار تنگی نفس بودند. آخرین باری که در یکی از بیمارستان‌های قم بستری شدند، مشاور قلب‌شون تشخیص دادند که به‌دلیل نارسایی و تنگی شدید دریچۀ آئورت و همین‌طور، مشکلات دیگه‌ای در دریچۀ میترال و بالا بودن فشار ریه، باید برن تهران و عمل قلب انجام بدن؛ منتها به‌خاطر بالا بودن سن بیمار (74 سال) و ضعف بدنی‌شون، توصیه بر این بود که به‌جای عمل قلب باز، عمل تاوی براشون انجام بشه، اونم توسط دکتر ایوب صالحی که متخصص این کار هستند. بنده بعد از مدتی با دکتر صالحی تماس گرفتم و شرایط پدرمو براشون توضیح دادم. ایشون هم با بزرگواری تمام، خودشون پی‌گیر کار شدند و تمام تلاش‌شون رو کردند تا با کم‌ترین هزینه، در یکی از بهترین بیمارستان‌های تهران و در کوتاه‌ترین زمان و با بالاترین میزان موفقیت، عمل تاوی برای پدرم انجام بشه. امروز دومین روزیه که پدرم از بیمارستان گاندی مرخص شدند و در حال حاضر، شرایط‌شون خیلی خوبه و خودشون، کارهای شخصی‌شونو انجام میدن. ما همگی، این شرایط خوب رو مدیون لطف پروردگار و تلاش‌های شبانه‌روزی دکتر صالحی هستیم که بسیار متخصصانه، دلسوزانه، صبورانه و متعهدانه با بیمار قلبی ما برخورد کردند. امیدوارم مردم این سرزمین، قدرشناس چنین جوانان برومند و پُردل و جرأتی باشند. برای ایشان و تمامی عزیزان‌شان، سعادتمندی در دنیا و آخرت را آرزومندم."}/>
      </section>
      </section></>;
}
